Autodesk.Revit.DB.MultiReferenceAnnotation.Is3DViewValidForDimension(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
If the DimensionStyle is LinearFixed, it cannot be created in a 3D View.
If the DimensionStyle is Linear, it cannot be created in a 3D View if the view direction is perpendicular to the current work plane normal.
Returns true if the ownerViewId is not a 3D view.
document:
The document for the multi-reference annotation.
ownerViewId:
The view in which the multi-reference annotation will appear.
options:
Options containing the references which the dimension will witness.
Returns:
True if the view is suitable for placing the MultiReferenceAnnotation.
False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.MultiReferenceAnnotation.AreReferencesValidForLinearFixedDimension(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
If the DimensionStyleType is LinearFixed, validates that the references are valid
for an aligned multi-reference annotation.
document:
The document for the multi-reference annotation.
ownerViewId:
The view in which the multi-reference annotation will appear.
options:
Options containing the references which the dimension will witness.
Returns:
True DimensionStyleType does not equal LinearFixed or
if an aligned multi-reference annotation can be created from the references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotation.AreReferencesValidForLinearDimension(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
If the DimensionStyleType is Linear, validates that the references are valid
for an aligned multi-reference annotation.
document:
The document for the multi-reference annotation.
ownerViewId:
The view in which the multi-reference annotation will appear.
options:
Options containing the references which the dimension will witness.
Returns:
True DimensionStyleType does not equal Linear or
if an aligned multi-reference annotation can be created from the references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotation.AreElementsValidForMultiReferenceAnnotation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
The method validates if the input elements match the element category id for the MultiReferenceAnnotationType.
document:
The document for the multi-reference annotation.
options:
The creation options for the new MultiReferenceAnnotation.
Returns:
Returns true if the input elements match the element category id for the MultiReferenceAnnotationType,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.MultiReferenceAnnotation.IsLinearFixedDimensionDirectionValid(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
If the DimensionStyleType is LinearFixed, this function verifies that the dimension line direction
matches either the view's vertical or horizontal direction.
document:
The document for the view.
viewId:
The view in which the dimension line direction will be tested.
options:
Options containing the DimensionStyleType and dimension line direction to test.
Returns:
True if the DimensionStyleType is LinearFixed and the dimension line direction can be used in the view.
True if the DimensionStyleType is not LinearFixed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotation.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.MultiReferenceAnnotationOptions)
Creates a new MultiReferenceAnnotation.
Remarks:
New linear Dimension and IndependentTag elements will be created as children of the MultiReferenceAnnotation.
The IndependentTag will only be created if the MultiReferenceAnnotationType property TagTypeId is valid.
document:
The document to which the new MultiReferenceAnnotation will be added.
ownerViewId:
The view in which the multi-reference annotation will appear.
options:
The creation options for the new MultiReferenceAnnotation.
Returns:
The new MultiReferenceAnnotation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The ElementId ownerViewId does not correspond to a View.
-or-
The ElementId ownerViewId is a view template.
-or-
The ElementId ownerViewId is a perspective view.
-or-
The 3D view ownerViewId is not locked.
-or-
The input 3D view cannot be used to place a MultiReferenceAnnotation object.
-or-
dimension line direction and dimension plane normal are not orthogonal.
-or-
There is at least one element that doesn't match the reference category of the MultiReferenceAnnotationType, or there are no elements.
-or-
for DimensionStyleType LinearFixed dimensions the dimension line direction must be parallel to either the view's vertical or horizontal direction.
-or-
some references can't be used with a DimensionStyleType Linear dimension of this direction.
References must either appear as points in the view or be linear references which are
perpendicular to the dimension line.
-or-
some references can't be used with a DimensionStyleType LinearFixed dimension.
Only references which appear as points in the view can be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014